//
// Created by admin on 2023/2/28.
//

#include "L5_obj_继承与派生.h"
#include <iostream>
using namespace std;

int main(){
    cout << "L4 类的继承与派生" << endl;

    return 0;
}

/*
 * Target:
 * 1.理解类的继承与派生的概念，掌握派生类的定义方法，了解3中继承方式下，派生类能从基类继承的元素有哪些；
 * 2.了解继承关系中友元和静态成员变量的派生特点；
 * 3.了解单重继承与多重继承的概念和异同点，了解派生层次；
 * 4.掌握访问权限控制符的含义，掌握基类与派生类之间的访问方式；
 * 5.掌握派生类的构造函数和析构函数的定义方法，了解基类与派生类构造函数与析构函数的调用次序；
 * 6.了解类之间的关系，能够定义封闭类的派生类，掌握封闭类的派生类的构造函数与析构函数的调用次序；
 * 7.掌握基类与派生类指针的含义，能够实现互相转换；
 *
 *
 * --------------------------------------------------------------------------------------------------
 *
 *
 */